component/onvif/onvifgen/xml/DeviceBinding.SetDot1XConfiguration.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
    xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope"
    xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding"
    xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
    xmlns:wsdd="http://schemas.xmlsoap.org/ws/2005/04/discovery"
    xmlns:chan="http://schemas.microsoft.com/ws/2005/02/duplex"
    xmlns:wsa5="http://www.w3.org/2005/08/addressing"
    xmlns:xmime="http://tempuri.org/xmime.xsd"
    xmlns:xop="http://www.w3.org/2004/08/xop/include"
    xmlns:ns1="http://www.onvif.org/ver20/analytics/humanface"
    xmlns:ns2="http://www.onvif.org/ver20/analytics/humanbody"
    xmlns:tt="http://www.onvif.org/ver10/schema"
    xmlns:wsrfbf="http://docs.oasis-open.org/wsrf/bf-2"
    xmlns:wstop="http://docs.oasis-open.org/wsn/t-1"
    xmlns:wsrfr="http://docs.oasis-open.org/wsrf/r-2"
    xmlns:tad="http://www.onvif.org/ver10/analyticsdevice/wsdl"
    xmlns:tan="http://www.onvif.org/ver20/analytics/wsdl"
    xmlns:tdn="http://www.onvif.org/ver10/network/wsdl"
    xmlns:tds="http://www.onvif.org/ver10/device/wsdl"
    xmlns:tev="http://www.onvif.org/ver10/events/wsdl"
    xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2"
    xmlns:timg="http://www.onvif.org/ver20/imaging/wsdl"
    xmlns:tls="http://www.onvif.org/ver10/display/wsdl"
    xmlns:tmd="http://www.onvif.org/ver10/deviceIO/wsdl"
    xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl"
    xmlns:trc="http://www.onvif.org/ver10/recording/wsdl"
    xmlns:trp="http://www.onvif.org/ver10/replay/wsdl"
    xmlns:trt="http://www.onvif.org/ver10/media/wsdl"
    xmlns:trv="http://www.onvif.org/ver10/receiver/wsdl"
    xmlns:tse="http://www.onvif.org/ver10/search/wsdl">
 <SOAP-ENV:Body>
   <tds:SetDot1XConfiguration>
    <tds:Dot1XConfiguration xsi:type="tt:Dot1XConfiguration">
     <tt:Dot1XConfigurationToken xsi:type="tt:ReferenceToken"></tt:Dot1XConfigurationToken>
     <tt:Identity xsi:type="xsd:string"></tt:Identity>
     <tt:AnonymousID xsi:type="xsd:string"></tt:AnonymousID>
     <tt:EAPMethod xsi:type="xsd:int">0</tt:EAPMethod>
     <tt:CACertificateID xsi:type="xsd:token"></tt:CACertificateID>
     <tt:EAPMethodConfiguration xsi:type="tt:EAPMethodConfiguration">
      <tt:TLSConfiguration xsi:type="tt:TLSConfiguration">
       <tt:CertificateID xsi:type="xsd:token"></tt:CertificateID>
       <!-- extensibility element(s) -->

      </tt:TLSConfiguration>
      <tt:Password xsi:type="xsd:string"></tt:Password>
      <tt:Extension xsi:type="tt:EapMethodExtension">
       <!-- extensibility element(s) -->

      </tt:Extension>
     </tt:EAPMethodConfiguration>
     <tt:Extension xsi:type="tt:Dot1XConfigurationExtension">
      <!-- extensibility element(s) -->

     </tt:Extension>
    </tds:Dot1XConfiguration>
   </tds:SetDot1XConfiguration>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
